PyDevices/displayif/src/ports/esp32/mod_dotclockframebuffer.c
// SPDX-License-Identifier: MIT
// Dot-clock RGB framebuffer for esp32 port (ESP-IDF esp_lcd RGB panel).
//
// Python: dotclockframebuffer.DotClockFramebuffer (matches CircuitPython).
// Same continuous DMA scanout + DRAM bounce as CP, but MP presents via double
// panel FBs (paint back, swap on refresh) because LVGL blits directly into the
// FB; CP paints a separate Bitmap and FramebufferDisplay composites.
//
// Two independent mechanisms (do not conflate):
//   * Bounce buffer (DRAM) — required on large PSRAM DPI panels; without it
//     the image slides horizontally under load.
//   * Double panel FBs + auto_refresh=False — tear-free present for LVGL;
//     fill_rect/blit without show()/refresh() leaves the panel on the old
//     front (looks black/white). A single-FB + auto_refresh=True experiment
//     made fill_rect visible without show() but brought mid-scan blackouts
//     back under LVGL animation (T-RGB / LCD-7).
//
// Buffer typecode 'B', native blit/fill_rect. Reference: Qualia S3 + TL040HDS20.
// Lifecycle: idempotent deinit/__del__/ctor + soft-reset teardown
// (see src/include/displayif/soft_reset.h, docs/idempotent-lifecycle.md,
// docs/soft-reset-and-bring-up.md).

#include <string.h>
#include <stdlib.h>

#include "py/runtime.h"
#include "py/obj.h"
#include "py/binary.h"
#include "py/mpprint.h"
#include "displayif/mp_helpers.h"
#include "displayif/soft_reset.h"

#define DCFB_MAX_DATA_PINS 18
#define DCFB_NUM_FBS 2
#define DCFB_PRESENT_TIMEOUT_US 100000

#if defined(ESP_PLATFORM)
#include "esp_heap_caps.h"
#include "esp_err.h"
#include "esp_timer.h"
#include "soc/soc_caps.h"
#if SOC_LCD_RGB_SUPPORTED
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_rgb.h"
#include "esp_cache.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#endif
#endif

#include "displayif_esp32_pins.h"

typedef struct _dotclockframebuffer_obj_t {
    mp_obj_base_t base;
    uint16_t width;
    uint16_t height;
    uint16_t row_stride;
    uint8_t *buf;
    size_t buf_len;
    bool buf_owned; // true if we malloc'd buf; false if owned by esp_lcd panel
    int de_pin;
    int vsync_pin;
    int hsync_pin;
    int dclk_pin;
    int data_pins[DCFB_MAX_DATA_PINS];
    size_t data_pin_count;
    uint32_t frequency;
    uint16_t hsync_pulse_width;
    uint16_t hsync_front_porch;
    uint16_t hsync_back_porch;
    uint16_t vsync_pulse_width;
    uint16_t vsync_front_porch;
    uint16_t vsync_back_porch;
    bool hsync_idle_low;
    bool vsync_idle_low;
    bool de_idle_high;
    bool pclk_active_high;
    bool pclk_idle_high;
    int overscan_left;
    uint8_t bits_per_pixel;
    bool deinited;
#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
    esp_lcd_panel_handle_t panel;
    bool panel_ready;
    // Bounce DRAM refill memcpy's the PSRAM FB through the CPU cache. Explicit
    // esp_cache_msync on every blit contends on SPI0 with that ISR and causes
    // faint flicker (IDF draw_bitmap also skips FB msync when bb_size != 0).
    bool bounce_enabled;
    // Tear-free present: blit into fbs[draw_index]; refresh() promotes it and
    // switches draw to the other panel FB after bounce adopts the new front.
    uint8_t *fbs[DCFB_NUM_FBS];
    uint8_t draw_index;
    uint8_t num_fbs;
#endif
} dotclockframebuffer_obj_t;

#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
typedef struct {
    esp_lcd_panel_handle_t panel;
    bool panel_ready;
} dcfb_host_t;

static dcfb_host_t s_host;
#endif
static bool s_soft_reset_registered;

static const mp_obj_type_t dotclockframebuffer_type;

#if defined(ESP_PLATFORM)
static uint8_t *dotclockframebuffer_alloc(size_t nbytes) {
    uint8_t *ptr = heap_caps_malloc(nbytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (ptr == NULL) {
        mp_printf(&mp_plat_print,
            "displayif: SPIRAM alloc failed (%u bytes); trying internal heap. "
            "Enable CONFIG_SPIRAM and size PSRAM in sdkconfig for large RGB panels.\n",
            (unsigned)nbytes);
        ptr = heap_caps_malloc(nbytes, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    return ptr;
}

static void dotclockframebuffer_free(uint8_t *ptr) {
    if (ptr != NULL) {
        heap_caps_free(ptr);
    }
}
#else
static uint8_t *dotclockframebuffer_alloc(size_t nbytes) {
    return malloc(nbytes);
}

static void dotclockframebuffer_free(uint8_t *ptr) {
    free(ptr);
}
#endif

#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
static void dcfb_host_teardown(void) {
    if (s_host.panel_ready && s_host.panel != NULL) {
        esp_lcd_panel_del(s_host.panel);
        s_host.panel = NULL;
        s_host.panel_ready = false;
    }
}

static void dcfb_ensure_soft_reset_registered(void) {
    if (!s_soft_reset_registered) {
        displayif_register_soft_reset(dcfb_host_teardown);
        s_soft_reset_registered = true;
    }
}

static void dotclockframebuffer_raise_esp_err(esp_err_t err) {
    if (err == ESP_OK) {
        return;
    }
    mp_raise_msg_varg(&mp_type_OSError, MP_ERROR_TEXT("ESP-IDF error %d (%s)"), err, esp_err_to_name(err));
}

// Match CircuitPython DotClockFramebuffer: RGB565 wire order is B0..B4, G0..G5, R0..R4.
static void dotclockframebuffer_fill_data_pins(dotclockframebuffer_obj_t *self, mp_obj_t red, mp_obj_t green, mp_obj_t blue) {
    int pins[DCFB_MAX_DATA_PINS];
    size_t n_blue = displayif_esp32_pin_seq_to_gpios(blue, pins, DCFB_MAX_DATA_PINS);
    size_t n_green = displayif_esp32_pin_seq_to_gpios(green, pins + n_blue, DCFB_MAX_DATA_PINS - n_blue);
    size_t n_red = displayif_esp32_pin_seq_to_gpios(red, pins + n_blue + n_green,
        DCFB_MAX_DATA_PINS - n_blue - n_green);
    size_t count = n_blue + n_green + n_red;
    if (!(n_red == 5 && n_green == 6 && n_blue == 5)) {
        mp_raise_ValueError(MP_ERROR_TEXT("red/green/blue must be 5/6/5 pins (RGB565)"));
    }
    if (count == 0 || count > DCFB_MAX_DATA_PINS) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid RGB data pin layout"));
    }

    self->data_pin_count = count;
    for (size_t i = 0; i < DCFB_MAX_DATA_PINS; i++) {
        self->data_pins[i] = (i < count) ? pins[i] : -1;
    }
}

