PyDevices/displayif/src/ports/esp32/mod_dotclockframebuffer.c
    if (self->overscan_left != 0) {
        dotclockframebuffer_raise_esp_err(esp_lcd_panel_set_gap(panel, self->overscan_left, 0));
    }

    esp_lcd_rgb_panel_event_callbacks_t cbs = {
        .on_frame_buf_complete = dcfb_on_frame_buf_complete,
    };
    dotclockframebuffer_raise_esp_err(esp_lcd_rgb_panel_register_event_callbacks(panel, &cbs, NULL));

    // Kick DMA once (CircuitPython does the same), then use the panel FBs.
    uint16_t kick = 0;
    dotclockframebuffer_raise_esp_err(esp_lcd_panel_draw_bitmap(panel, 0, 0, 1, 1, &kick));

    void *fb0 = NULL;
    void *fb1 = NULL;
    dotclockframebuffer_raise_esp_err(esp_lcd_rgb_panel_get_frame_buffer(panel, 2, &fb0, &fb1));
    if (fb0 == NULL || fb1 == NULL) {
        esp_lcd_panel_del(panel);
        mp_raise_msg(&mp_type_MemoryError, MP_ERROR_TEXT("RGB panel frame buffer missing"));
    }

    // Drop any provisional malloc; panel owns the scanout buffers.
    if (self->buf_owned && self->buf != NULL) {
        dotclockframebuffer_free(self->buf);
    }
    self->fbs[0] = (uint8_t *)fb0;
    self->fbs[1] = (uint8_t *)fb1;
    self->num_fbs = DCFB_NUM_FBS;
    // Kick starts scanning fb0; paint the other until first refresh().
    self->draw_index = 1;
    self->buf = self->fbs[self->draw_index];
    self->buf_owned = false;
    self->row_stride = (uint16_t)(2 * h_res);
    self->buf_len = (size_t)self->row_stride * self->height;
    self->bounce_enabled = (panel_config.bounce_buffer_size_px != 0);
    memset(self->fbs[0], 0, self->buf_len);
    memset(self->fbs[1], 0, self->buf_len);
    // One-time writeback so the first bounce refill sees zeros.
    esp_cache_msync(self->fbs[0], self->buf_len, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
    esp_cache_msync(self->fbs[1], self->buf_len, ESP_CACHE_MSYNC_FLAG_DIR_C2M);

    self->panel = panel;
    self->panel_ready = true;
    s_host.panel = panel;
    s_host.panel_ready = true;
}
#endif

static void dotclockframebuffer_deinit_internal(dotclockframebuffer_obj_t *self) {
    if (self->deinited) {
        return;
    }
#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
    if (s_host.panel_ready && s_host.panel != NULL) {
        esp_lcd_panel_del(s_host.panel);
        s_host.panel = NULL;
        s_host.panel_ready = false;
        self->panel = NULL;
        self->panel_ready = false;
        // Panel deletion frees its FB; do not heap_caps_free it.
        self->buf = NULL;
        self->buf_owned = false;
    }
#endif
    if (self->buf_owned && self->buf != NULL) {
        dotclockframebuffer_free(self->buf);
        self->buf = NULL;
        self->buf_owned = false;
    }
    self->deinited = true;
}

static mp_obj_t dotclockframebuffer_make(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    enum {
        ARG_de,
        ARG_vsync,
        ARG_hsync,
        ARG_dclk,
        ARG_red,
        ARG_green,
        ARG_blue,
        ARG_frequency,
        ARG_width,
        ARG_height,
        ARG_hsync_pulse_width,
        ARG_hsync_front_porch,
        ARG_hsync_back_porch,
        ARG_vsync_pulse_width,
        ARG_vsync_front_porch,
        ARG_vsync_back_porch,
        ARG_hsync_idle_low,
        ARG_vsync_idle_low,
        ARG_de_idle_high,
        ARG_pclk_active_high,
        ARG_pclk_idle_high,
        ARG_overscan_left,
    };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_de, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = MP_OBJ_NULL } },
        { MP_QSTR_vsync, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = MP_OBJ_NULL } },
        { MP_QSTR_hsync, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = MP_OBJ_NULL } },
        { MP_QSTR_dclk, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = MP_OBJ_NULL } },
        { MP_QSTR_red, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = MP_OBJ_NULL } },
        { MP_QSTR_green, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = MP_OBJ_NULL } },
        { MP_QSTR_blue, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = MP_OBJ_NULL } },
        { MP_QSTR_frequency, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 } },
        { MP_QSTR_width, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 } },
        { MP_QSTR_height, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 } },
        { MP_QSTR_hsync_pulse_width, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 } },
        { MP_QSTR_hsync_front_porch, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 } },
        { MP_QSTR_hsync_back_porch, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 } },
        { MP_QSTR_vsync_pulse_width, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 } },
        { MP_QSTR_vsync_front_porch, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 } },
        { MP_QSTR_vsync_back_porch, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 } },
        { MP_QSTR_hsync_idle_low, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false } },
        { MP_QSTR_vsync_idle_low, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false } },
        { MP_QSTR_de_idle_high, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false } },
        { MP_QSTR_pclk_active_high, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false } },
        { MP_QSTR_pclk_idle_high, MP_ARG_REQUIRED | MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false } },
        { MP_QSTR_overscan_left, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 } },
    };
    mp_arg_val_t vals[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, args, MP_ARRAY_SIZE(allowed_args), allowed_args, vals);

    if (vals[ARG_width].u_int <= 0 || vals[ARG_height].u_int <= 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("width and height must be positive"));
    }
    if (vals[ARG_frequency].u_int <= 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("frequency must be positive"));
    }

#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
    dcfb_host_teardown();
    dcfb_ensure_soft_reset_registered();
#endif

