PyDevices/displayif/src/ports/esp32/mod_dotclockframebuffer.c
    dotclockframebuffer_obj_t *self = mp_obj_malloc(dotclockframebuffer_obj_t, type);
    self->width = vals[ARG_width].u_int;
    self->height = vals[ARG_height].u_int;
    self->row_stride = self->width * sizeof(uint16_t);
    self->buf_len = (size_t)self->row_stride * self->height;
    self->buf = NULL;
    self->buf_owned = false;

    self->de_pin = displayif_esp32_pin_gpio(vals[ARG_de].u_obj);
    self->vsync_pin = displayif_esp32_pin_gpio(vals[ARG_vsync].u_obj);
    self->hsync_pin = displayif_esp32_pin_gpio(vals[ARG_hsync].u_obj);
    self->dclk_pin = displayif_esp32_pin_gpio(vals[ARG_dclk].u_obj);
    self->frequency = vals[ARG_frequency].u_int;
    self->hsync_pulse_width = vals[ARG_hsync_pulse_width].u_int;
    self->hsync_front_porch = vals[ARG_hsync_front_porch].u_int;
    self->hsync_back_porch = vals[ARG_hsync_back_porch].u_int;
    self->vsync_pulse_width = vals[ARG_vsync_pulse_width].u_int;
    self->vsync_front_porch = vals[ARG_vsync_front_porch].u_int;
    self->vsync_back_porch = vals[ARG_vsync_back_porch].u_int;
    self->hsync_idle_low = vals[ARG_hsync_idle_low].u_bool;
    self->vsync_idle_low = vals[ARG_vsync_idle_low].u_bool;
    self->de_idle_high = vals[ARG_de_idle_high].u_bool;
    self->pclk_active_high = vals[ARG_pclk_active_high].u_bool;
    self->pclk_idle_high = vals[ARG_pclk_idle_high].u_bool;
    self->overscan_left = vals[ARG_overscan_left].u_int;
    self->bits_per_pixel = 16;
    self->deinited = false;
#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
    self->panel = NULL;
    self->panel_ready = false;
    self->bounce_enabled = false;
    self->fbs[0] = NULL;
    self->fbs[1] = NULL;
    self->draw_index = 0;
    self->num_fbs = 0;
#endif
    self->data_pin_count = 0;

#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
    dotclockframebuffer_fill_data_pins(self, vals[ARG_red].u_obj, vals[ARG_green].u_obj,
        vals[ARG_blue].u_obj);
    // Start continuous scanout immediately (CircuitPython DotClockFramebuffer model).
    dotclockframebuffer_init_panel(self);
#else
    // Host stub: software buffer only (no ESP-IDF RGB panel).
    self->buf = dotclockframebuffer_alloc(self->buf_len);
    if (self->buf == NULL) {
        mp_raise_msg(&mp_type_MemoryError, MP_ERROR_TEXT("RGB framebuffer allocation failed"));
    }
    self->buf_owned = true;
    memset(self->buf, 0, self->buf_len);
#endif

    return MP_OBJ_FROM_PTR(self);
}

static mp_obj_t dotclockframebuffer_refresh(mp_obj_t self_in) {
    dotclockframebuffer_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->deinited || self->buf == NULL) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("RGB framebuffer is deinited"));
    }
#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
    if (!self->panel_ready || self->panel == NULL || self->num_fbs < 2) {
        // Single-FB / stub: cache writeback only (no tear-free swap).
        dotclockframebuffer_msync_rows(self, 0, self->height);
        return mp_const_none;
    }

    // Promote the back buffer. IDF draw_bitmap with a panel-FB pointer only
    // updates cur_fb_index; bounce adopts it on the next frame wrap.
    uint8_t presented = self->draw_index;
    uint32_t start_frames = s_dcfb_frame_count;
    dotclockframebuffer_raise_esp_err(
        esp_lcd_panel_draw_bitmap(self->panel, 0, 0, self->width, self->height, self->fbs[presented]));

    // Wait until bounce wraps onto the new front so the old front is idle.
    int64_t deadline = esp_timer_get_time() + DCFB_PRESENT_TIMEOUT_US;
    while (s_dcfb_frame_count == start_frames) {
        if (esp_timer_get_time() >= deadline) {
            // Keep painting the same back buffer; next show() retries present.
            return mp_const_none;
        }
        vTaskDelay(1);
    }

    // Advance the paint target. Do not memcpy the full FB — that costs
    // ~100ms+ on 800x480 PSRAM and is redundant when a dual-buffer GUI
    // (e.g. LVGL DIRECT) already syncs dirty regions across both panel FBs.
    // Painters that only touch dirty areas stay correct after the flip.
    uint8_t next = (uint8_t)(1 - presented);
    self->draw_index = next;
    self->buf = self->fbs[next];
    return mp_const_none;
#else
    mp_raise_msg(&mp_type_NotImplementedError, MP_ERROR_TEXT("ESP-IDF dotclock scanout not supported on this target"));
#endif
}
static MP_DEFINE_CONST_FUN_OBJ_1(dotclockframebuffer_refresh_obj, dotclockframebuffer_refresh);

/* blit(buf, x, y, w, h) — C memcpy into the scanout FB.
 * MicroPython has no memoryview.cast; FBDisplay's uint16 per-pixel path is
 * ~2s for 720x720. Native blit matches mipidsi / the CircuitPython Qualia fix. */
static mp_obj_t dotclockframebuffer_blit(size_t n_args, const mp_obj_t *args) {
    (void)n_args;
    dotclockframebuffer_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    if (self->deinited || self->buf == NULL) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("RGB framebuffer is deinited"));
    }
    mp_buffer_info_t srcinfo;
    mp_get_buffer_raise(args[1], &srcinfo, MP_BUFFER_READ);
    int x = mp_obj_get_int(args[2]);
    int y = mp_obj_get_int(args[3]);
    int w = mp_obj_get_int(args[4]);
    int h = mp_obj_get_int(args[5]);
    if (x < 0 || y < 0 || w <= 0 || h <= 0 || x + w > self->width || y + h > self->height) {
        mp_raise_ValueError(MP_ERROR_TEXT("blit rect out of range"));
    }
    size_t row_bytes = (size_t)w * sizeof(uint16_t);
    if (srcinfo.len < row_bytes * (size_t)h) {
        mp_raise_ValueError(MP_ERROR_TEXT("blit buffer too small"));
    }
    const uint8_t *src = srcinfo.buf;
    uint8_t *dst = self->buf + (size_t)y * self->row_stride + (size_t)x * sizeof(uint16_t);
    for (int row = 0; row < h; row++) {
        memcpy(dst, src, row_bytes);
        dst += self->row_stride;
        src += row_bytes;
    }
#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
    dotclockframebuffer_msync_rows(self, y, h);
#endif
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(dotclockframebuffer_blit_obj, 6, 6, dotclockframebuffer_blit);

/* fill_rect(x, y, w, h, color) — C RGB565 fill (MP has no bitmaptools). */
static mp_obj_t dotclockframebuffer_fill_rect(size_t n_args, const mp_obj_t *args) {
    (void)n_args;
    dotclockframebuffer_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    if (self->deinited || self->buf == NULL) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("RGB framebuffer is deinited"));
    }
    int x = mp_obj_get_int(args[1]);
    int y = mp_obj_get_int(args[2]);
    int w = mp_obj_get_int(args[3]);
    int h = mp_obj_get_int(args[4]);
    uint16_t color = (uint16_t)mp_obj_get_int(args[5]);
    if (x < 0 || y < 0 || w <= 0 || h <= 0 || x + w > self->width || y + h > self->height) {
        mp_raise_ValueError(MP_ERROR_TEXT("fill_rect out of range"));
    }
    for (int row = 0; row < h; row++) {
        uint16_t *dst = (uint16_t *)(self->buf + (size_t)(y + row) * self->row_stride + (size_t)x * sizeof(uint16_t));
        for (int col = 0; col < w; col++) {
            dst[col] = color;
        }
    }
#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
    dotclockframebuffer_msync_rows(self, y, h);
#endif
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(dotclockframebuffer_fill_rect_obj, 6, 6, dotclockframebuffer_fill_rect);

static mp_int_t dotclockframebuffer_get_buffer(mp_obj_t self_in, mp_buffer_info_t *bufinfo, mp_uint_t flags) {
    (void)flags;
    dotclockframebuffer_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->deinited || self->buf == NULL) {
        bufinfo->buf = NULL;
        bufinfo->len = 0;
        bufinfo->typecode = 'B';
        return 0;
    }
    bufinfo->buf = self->buf;
    bufinfo->len = self->buf_len;
    // Byte-addressable for displaysys.FBDisplay (MP has no memoryview.cast).
    bufinfo->typecode = 'B';
    return 0;
}

static mp_obj_t dotclockframebuffer_del(mp_obj_t self_in) {
    dotclockframebuffer_obj_t *self = MP_OBJ_TO_PTR(self_in);
    dotclockframebuffer_deinit_internal(self);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(dotclockframebuffer_del_obj, dotclockframebuffer_del);

