PyDevices/displayif/src/ports/esp32/mod_dotclockframebuffer.c
// Panel FB views for GUI direct-paint (LVGL DIRECT, etc.). External refs —
// do not free; lifetime follows the DotClockFramebuffer object.
static mp_obj_t dotclockframebuffer_framebuffers(mp_obj_t self_in) {
    dotclockframebuffer_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->deinited) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("RGB framebuffer is deinited"));
    }
#if defined(ESP_PLATFORM) && SOC_LCD_RGB_SUPPORTED
    if (self->num_fbs >= 2 && self->fbs[0] != NULL && self->fbs[1] != NULL) {
        mp_obj_t items[2] = {
            mp_obj_new_bytearray_by_ref(self->buf_len, self->fbs[0]),
            mp_obj_new_bytearray_by_ref(self->buf_len, self->fbs[1]),
        };
        return mp_obj_new_tuple(2, items);
    }
#endif
    if (self->buf == NULL) {
        return mp_const_empty_tuple;
    }
    mp_obj_t items[1] = {
        mp_obj_new_bytearray_by_ref(self->buf_len, self->buf),
    };
    return mp_obj_new_tuple(1, items);
}
static MP_DEFINE_CONST_FUN_OBJ_1(dotclockframebuffer_framebuffers_obj, dotclockframebuffer_framebuffers);

static void dotclockframebuffer_attr(mp_obj_t self_in, qstr attr, mp_obj_t *dest) {
    dotclockframebuffer_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (dest[0] == MP_OBJ_NULL) {
        // Custom attr replaces locals_dict lookup — expose methods here (see mipidsi).
        if (attr == MP_QSTR_width) {
            dest[0] = mp_obj_new_int(self->width);
        } else if (attr == MP_QSTR_height) {
            dest[0] = mp_obj_new_int(self->height);
        } else if (attr == MP_QSTR_row_stride) {
            dest[0] = mp_obj_new_int(self->row_stride);
        } else if (attr == MP_QSTR_buf_len) {
            dest[0] = mp_obj_new_int(self->buf_len);
        } else if (attr == MP_QSTR_auto_refresh) {
            // False: FBDisplay.show() must call refresh() to promote the back
            // buffer. (CP Qualia uses True because displayio composites a
            // separate Bitmap; MP LVGL paints this FB directly.)
            dest[0] = mp_const_false;
        } else if (attr == MP_QSTR_framebuffers) {
            dest[0] = MP_OBJ_FROM_PTR(&dotclockframebuffer_framebuffers_obj);
            dest[1] = self_in;
        } else if (attr == MP_QSTR_refresh) {
            dest[0] = MP_OBJ_FROM_PTR(&dotclockframebuffer_refresh_obj);
            dest[1] = self_in;
        } else if (attr == MP_QSTR_blit) {
            dest[0] = MP_OBJ_FROM_PTR(&dotclockframebuffer_blit_obj);
            dest[1] = self_in;
        } else if (attr == MP_QSTR_fill_rect) {
            dest[0] = MP_OBJ_FROM_PTR(&dotclockframebuffer_fill_rect_obj);
            dest[1] = self_in;
        } else if (attr == MP_QSTR_deinit) {
            dest[0] = MP_OBJ_FROM_PTR(&dotclockframebuffer_del_obj);
            dest[1] = self_in;
        } else if (attr == MP_QSTR___del__) {
            dest[0] = MP_OBJ_FROM_PTR(&dotclockframebuffer_del_obj);
            dest[1] = self_in;
        }
    }
}

static const mp_rom_map_elem_t dotclockframebuffer_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_refresh), MP_ROM_PTR(&dotclockframebuffer_refresh_obj) },
    { MP_ROM_QSTR(MP_QSTR_blit), MP_ROM_PTR(&dotclockframebuffer_blit_obj) },
    { MP_ROM_QSTR(MP_QSTR_fill_rect), MP_ROM_PTR(&dotclockframebuffer_fill_rect_obj) },
    { MP_ROM_QSTR(MP_QSTR_framebuffers), MP_ROM_PTR(&dotclockframebuffer_framebuffers_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&dotclockframebuffer_del_obj) },
    { MP_ROM_QSTR(MP_QSTR___del__), MP_ROM_PTR(&dotclockframebuffer_del_obj) },
};
static MP_DEFINE_CONST_DICT(dotclockframebuffer_locals_dict, dotclockframebuffer_locals_dict_table);

static MP_DEFINE_CONST_OBJ_TYPE(
    dotclockframebuffer_type,
    MP_QSTR_DotClockFramebuffer,
    MP_TYPE_FLAG_NONE,
    make_new, dotclockframebuffer_make,
    attr, dotclockframebuffer_attr,
    locals_dict, &dotclockframebuffer_locals_dict,
    buffer, dotclockframebuffer_get_buffer
);

static const mp_rom_map_elem_t dotclockframebuffer_module_globals_table[] = {
    { MP_ROM_QSTR(MP_QSTR___name__), MP_ROM_QSTR(MP_QSTR_dotclockframebuffer) },
    { MP_ROM_QSTR(MP_QSTR_DotClockFramebuffer), MP_ROM_PTR(&dotclockframebuffer_type) },
};
static MP_DEFINE_CONST_DICT(dotclockframebuffer_module_globals, dotclockframebuffer_module_globals_table);

const mp_obj_module_t dotclockframebuffer_user_cmodule = {
    .base = { &mp_type_module },
    .globals = (mp_obj_dict_t *)&dotclockframebuffer_module_globals,
};

MP_REGISTER_MODULE(MP_QSTR_dotclockframebuffer, dotclockframebuffer_user_cmodule);
